class ShippingLocators:

    shipping_link = "//div[1]/div[2]/div[1]/div[1]/div[5]/div[1]/a[1]"

    # assertions
    ship_link = "//p[contains(text(),'שיטת השילוח שלנו נורא פשוטה.')]"
    ship_txt = "שיטת השילוח שלנו נורא פשוטה."

    # UI
    ui_link = "//body/div[@id='root']/div[1]/div[2]/div[2]"
    ui_txt = "שיטת השילוח שלנו נורא פשוטה.\n\nמהספק או מהמחסן הלוגיסטי,\n\nאליך עד 72 שעות.\n\nבין אם אתם קונים או מוכרים אתם יכולים להיות שקטים לגבי שיטת השילוח.\nעלות משטח 160 ש\"ח ללא מע\"מ   |    זמני הובלה 24-72 שעות   |   ההזמנה מגיעה עד פתח החנות\n1. קבלת ההזמנה.\nהספק מקבל את ההזמנה, ואורז אותה.\n2. סיום ההזמנה.\nהספק מסיים להכין את ההזמנה ומזמין את חברת השליחויות.\n*על המשטח להיות משורנק\n3. קבלת המשלוח.\nתוך 24 שעות מרגע האיסוף המשלוח יגיע לבית העסק.\n4. מאסף המשלוח.\nחברת השליחויות מגיעה תוך 24 שעות לאסוף את המשלוח"